// 0 Normal 1 Happy, 2 Sad, 3 Angry, 4 Shy, 5 Divine Mark, 6 Magic Mark, 7 Shy Surprised, 8 Laughing
{

  "Introduction": "I am Suanni, I come from the East. If you have nothing else to do, please leave quickly.",
  "SpouseGiftJealous": "The mist sent a message...$1#$b#Well....it's just a small matter, no problem.$1",
  "Divorced": "I will respect your decision. Beasts and humans should exist in two different worlds..$2#$b#Take care of yourself...$2",
  "Divorced_gift": "What are you thinking about? Our fate is over。",
  "dumped_Guys": "We used to be like this.....$2#$b#That's all, that's all...$2",
  "secondChance_Guys": "You...$2#$b#You can't ask me to do anything with you. $2#$b#Because you still have a place in my heart. $1",
  "breakUp": "Well...I think I understand what you mean. $2#$b#It's okay....$2#$b#Since that's what you want, then let it be. $2",
  "dating_SuanNi": "This flower...is the smell I like. $4",
  "dating_SuanNi_memory_oneday": "%The tail of the Suanni gently wrapped around your waist. You think this is his way of expressing",
  "married_SuanNi": "Then we...our current relationship...$4#$b#% Suanni scratched his head, and a blush appeared on his face involuntarily.。",
  "FlowerDance_Accept": "Do you think we are like Beauty and the Beast? $1#$b#I read this story in a book. $1#$b#Very touching. $1",
  "FlowerDance_Accept_Spouse": "Come on, I will be your beast again. $1",
  "FlowerDance_Accept_Decline": "Sorry..I'm not very good at this。",
  "danceRejection": "Sorry, I have other plans today.。",
 "WipedMemory": "I can feel...someone is manipulating my memory. $2#$b#If this is what you want....then so be it. #$b#I will not resist...$1",
  "DumpsterDiveComment": "I....I should respect your hobbies。",
  "AcceptBouquet": "%You clearly saw panic on Suanni's face. It was the first time you saw the lion in front of you with such an expression. #$b#I...I am much older than you. Are you serious? $7#$b#I actually also...$7#$b#%You didn't seem to hear the subsequent words clearly, but the flowers in front of you said it all.。",

  "RejectBouquet_Divorced": "Have you forgotten what you did to me?。",
  "RejectBouguet_NpcAlreadyMarried": "Sorry....I already have someone in my heart. $2",
  "RejectBouquet_VeryLowHearts": "Am I something you use to have fun?! $3",
  "RejectBouquet_LowHearts": "I think our relationship is not that good yet.。",
  "RejectBouquet": "Let me think about it...$2",

  "RejectGift_Divorced": "Hum.....#$b#% Suanni turned his head and left.。",
  "RejectMermaidPendant_playerwithsomeoneElse":"You should respect your partner more. #$b# Also respect me more。",
  "RejectMermaidPendant_Divorced":"I... can still remember, remember everything you have done. $2",
  "RejectMermaidPendant_NpcwithsomeoneElse":"Sorry....my heart has no room for anyone else. $2",
  "RejectMermaidPendant_Under8Hearts": "Sorry....Did I mislead you? $2",
  "RejectMermaidPendant_Under10Hearts":"I don't know you well enough. $2#$b#Please stay with me for a while longer. $1",
  "RejectMermaidPendant_Under10Hearts AskedAgain":"@, I... can't make up my mind yet. $2#$b#For you, for Stardew Valley. $2#$b#Give me some more time, okay? $2",
  "RejectMermaidPendant_NeedHouseUpgrade": "Your house is a little too small for me. $2#$b#That's not to say anything, it's just...$2#$b#I want you to have more space to move around comfortably. $1",

  "RejectMovieTicket_AlreadyInvitedBySomeoneElse": "I would love to watch it with you too...$2#$b# but I'm sorry... someone has already contacted me. $2",
  "RejectMovieTicket_AlreadyWatchedThisWeek": "We have already watched the movie this week. $1#$b# Come and accompany me in the next period of time. $1",
  "RejectMovieTicket_Divorced": "Is this the way to make peace?.....you....forget it....$2",
  "MovieInvitation": "Movies? $1#$b#Since you invited me, I will go. $1",

  "SpouseFarmhouseClutter": "Our room.....Is it time to clean it up? $2",
  "WinterStar_ReceiveGift": "Is this for me? $7#$b#Sorry.....I didn't expect...I would get a gift. $2#$b#But I really like it. $1#$b#Thank you, @. $1",

  "give_pendant": "I...have thought about this day. $7#$b#But when it really comes, I still can't help feeling excited and excited. $4#$b#Don't worry, I will prepare a human ceremony for you. $1#$b#Since you live in Stardew Valley, we will follow the way here. $1",
  "engageA": "Since you already have a contract with someone else, you shouldn't come to me again.。",
  "engageB": "I sense that there is already another person in your heart. #$b#Sorry....I can't accept your feelings。",

  "AcceptBirthdayGift_Loved": "!!! $7#$b#Is this a birthday gift for me? $7#$b#I am really flattered. $1",
  "AcceptBirthdayGift_Positive": "How did you know my birthday...$7#$b#I like this gift very much. $1",
  "AcceptBirthdayGift_Negative": "Today is indeed my birthday. $7#$b#This gift. $2#$b#Thank you for taking the trouble. $1",
  "AcceptBirthdayGift_Neutral": "Thank you, @. $1#$b#I like this birthday gift very much. $1",
  "AcceptBirthdayGift_Hated": "I don't know if you mean it. #$b# But this gift.....$2#$b# Forget it, thank you anyway...$1",
  "stardrop_gift": "@, I brought this for you. $1#$b#The spirit of this fruit is very unique, I think it should be helpful to you. $1",
  "GreenRain": "This weather....is not a force of nature....",
  "GreenRain_2": "Hmm.....The spirit is still disordered. #$b#Strange...too strange...",
  "GreenRainFinished": "Is it over? #$b# But the impact is still there. #$b# Let's continue to observe for a while.。",
  "Beach_Tue": "The air at the seaside is very good, which is one of the reasons why I come here often.",
  "Resort_Entering": "I didn't expect that there is such a place in Stardew Valley. $1#$b#Would it be faster if I flew over there...$1",
  "Resort_Leaving": "I might as well just fly back...",
  "Resort_Leaving_2": "Do you want to go back with me? $1#$b# I will welcome you。",
  "Resort_Chair": "Let me also.... take a short break. #$b#Enjoy the sun, the beach, and the human touch. $1#$e#Rest is indeed necessary...",
  "Resort_Bar": "I don't drink, never drink...",
  "Resort_Wander": "I once read a book about a man who was stranded on a desert island and had a humanoid spirit pet. $1#$b#What book? $1#$b#I think it was called Robinson Crusoe.",
  "Resort": "The spirits here seem to be of the same type as those in Stardew Valley.",
  "Resort_2": "There seems to be some secrets hidden here. $1#$b#@Be careful to protect yourself。",
  "Beach_Tue2": "Seagulls, sunset, and waves reflecting the light of the scales are so beautiful. $1",
  "Beach_Tue4": "Is fishing really that fun...#$b# I want to try it if I have a chance. #$b# No no no, it will scare the fish away...",
  "Beach_Tue6": "Hmm... I'm a little sleepy...$1#$b#% Suanni's figure swayed. #$b#@, do you suggest that I sleep next to you for a while? $1",
  "Beach_Fri": "Are you here today? $1#$b# I will go fishing with you. $1",
  "Beach_Fri2": "This direction...$1#$b#% Suanni looks a little sad.。",
  "Beach_Fri4": "@, here is this. [687]#$b# No need to thank me。",
  "Beach_Fri8": "%The figure of the Suanni is somewhat illusory, and he seems not to notice your approach. #$b#% But his mist is always lingering around you.",
  "Beach_Sat": "Do you hear... the echo of the ocean。",
  "Beach_Sat2": "I wonder if Rui....is okay. $2#$b#Sorry, don't take my words seriously. $1",
  "winterBeach": "I'm not afraid of the cold, it's okay. $1",
  "winterBeach4": "The snow here reminds me of my hometown. $2",
  "Mon": "If you have nothing else, leave..",
  "Mon2": "Stardew Valley is a great place where people know each other very well.",
  "Mon4": "If there's nothing else...#$b# forget it, it's okay to chat.",
  "Mon6": "Hmm... you humans are really weird. You get even closer to the lion when you see it. $1#$b# But I like it. $1#$e#@, you get too close.。",
  "Mon8": "@, I was wondering where you went today, so I prepared something for you. [275]#$b#Although it's a little old, I think you'll like it. $1#$e#Where did it come from? #$b#Would you believe me if I said I took it out from the incense burner?",
  "Mon10": "You smell really good, has anyone ever told you that? $1#$b#Sorry, it's easy for a Leo to say something like that and it could be misunderstood. $7",
  "Tue": "I see you are farming. #$b# Very nice behavior。",
  "Tue2": "Smoke all around me? #$b#I have been in this state for a long time...#$e#But you'd better stay away from me.。",
  "Tue4": "Are you okay? I saw you out late a few times. #$b# Take care of yourself。",
  "Tue6": "@, what do you want to do today? #$b# Well... I want to try it too. #$e# Go quickly, the time here seems a bit strange。",
  "Tue8": "%The Suanni didn't seem to notice you, but its mist was vaguely wrapped around your body.。",
  "Tue10": "@, I often wonder about the relationship between you and me....#$b#Sorry, maybe it's just my illusion...$7",
  "Wed": "You have things to do, too.。",
  "Wed2": "%Suan Ni seemed to be feeling something, and his tail was swaying slowly with his breathing.。",
  "Wed4": "I like this kind of place close to nature. $1#$b# It reminds me of the past in Luxiang. #$e# What is Luxiang? #$b# My home...",
  "Wed6": "I often see you running around town, and what I want to say is. #$b#Take care of yourself, things can take their time. $1",
  "Wed8": "@, do you need this? [499]#$b# Just take it. $1",
  "Wed10": "@, you seem to have grown up a lot. $1% Suanni's palm touched your head. The texture of the flesh mixed in the fur is quite comfortable? #$e# Sorry, I couldn't help but touch it. $7",
  "Thu": "%Suanni smiled at you and said nothing more。",
  "Thu2": "@, I have always wanted to ask #$q 247110/247111 qwork_1# what do you think of me?
	#$r 247110 0 qwork_earthy#A....black lion? .
	#$r 247111 10 qwork_hands#Although strangers are advised to stay away, unexpectedly it is a good guy.
	#$r 247111 10 qwork_grow#I don't know why, but I feel a little horny......",
	"qwork_earthy": "...I was too abrupt。",
	"qwork_hands": "Is that so? #$b#Thank you. $1",
	"qwork_grow": "...........$7#$b#Disrespectful person! $7",
	"qwork_1": "$p 247110#% Suanni shook his ears and walked away on his own.。",
  "Thu4": "My role? #$b# Actually, I never had one before...#$e# Let's talk about it later when we have a chance....",
  "Thu6": "Have you been to the house in the center of town? #$b# There seem to be some strange elves in there. #$b# Don't worry, they are not bad by nature. $1",
  "Thu8": "Do you remember that you asked me about Wujiao before? #$b# If you are still interested, would you like to...listen to it?",
  "Thu10": "@, can you come closer to me. #$b#%Suan Ni suddenly hugged you, and the warm body temperature and soft fur made you fall into it.....#$b#%Suan Ni suddenly turned into mist and ran away。",
  "Fri": "Hmm... This place is indeed full of strange power. #$b# Sorry, just treat me as talking nonsense.。",
  "Fri2": "Actually, you don't have to worry about stepping on my tail. #$b# Although I can't step on it at all....",
  "Fri4": "@, I found this on the road. [495 496 497 498]#$b#Take it if you need it.",
  "Fri6": "The fog is very thick today. #$b#@, what do you think of the fog? #$e# The fog is like an extension of my perception. #$b# I'm sorry I didn't mean to see you rummaging through the trash can. $7",
  "Fri8": "@, I have been thinking. #$b# Would you be willing to become my believer?..$5",
  "Fri10": "You should take a rest today... I have something to say to you. $2#$e#About me...$5",
  "Sat": "Hmm....Hello to you too。",
  "Sat2": "There is one thing I have never understood, how did you fit so many tools in there. #$e# Even so much garbage。",
  "Sat4": "A long time ago, I also often interacted with people. #$b# But that was a long time ago. $3#$e# Really...too long....$3",
  "Sat6": "I...seem to see that you are a little depressed. #$b#Take this, maybe it can cheer you up. [517]#$e#Its light is very gentle..",
  "Sat8": "I seem to be getting used to this town. #$b#Thanks to you, @. $2#$e#Thank you",
  "Sat10": "%The tail of the Suanni hooks your hand, and the strong lion seems to be trying to make himself look gentler. #$b# Do you have time? Come with me for a walk。",
  "Sun": "Aren't you afraid of me?",
  "Sun2": "According to your schedule today, shouldn't you take a rest?",
  "Sun4": "The fragrant grass is covered with star dew, and the mist attracts dragons and lions. $1",
  "Sun6": "The sunrise in this town is really beautiful...$1#$b# How about going to see it with me next time? $1",
  "Sun8": "Thank you for your usual gifts...#$b# I also prepared something. [688]#$b# I hope it is useful to you. $1",
  "Sun10": "Seeing you...I seem to become a little strange...$5#$b#% Suanni took your hand and gave you a gentle smile. $1",
  "spring_12": "The people in the town seem to be getting busy. $1#$b#Even the chickens...$1",
  "spring_23": "People's emotions seem to be getting stronger recently. $1#$b#@, have you ever heard of the Flower Dance Festival? $1",
  "summer_Mon": "Summer is coming so soon...$1#$b#The beach should be bustling. $1",
  "summer_Tue": "Do you have to run around in such a hot day?。",
  "summer_Wed2": "I can feel...$1#$b# the warm weather and the equally warm life. $1",
  "summer_Thu2": "Did you grow anything new that seems different from last season? $1",
  "summer_Sat6": "#Suan Ni gently wiped away the sweat on your forehead。",
  "summer_10": "@, Lewis told me that there will be a party tomorrow, will you go? $1#$e#What should I bring?...",
  "summer_27": "There are a lot of spirits gathering at the beach recently. $1#$b#I can feel that something special will happen tomorrow night. $1",
  "fall_Mon": "It's harvest season. $1#$b#If they were in Lu Township, they should have been busy. $1",
  "fall_Mon2": "Do you smell anything nice? $1#$b# It's the aroma of wheat. $1",
  "fall_Mon4": "It's time to prepare Qiuxiang...$2#$b# You asked me what is preparing Qiuxiang...$2#$b# It's a long story. $1#$b#",
  "fall_Tue": "Fruitful harvest and fragrant autumn millet。",
  "fall_Tue8": "@, do you need my help? $1#$b#Don't look at me like this, but I am a good hand at harvesting crops. $1#$e#%Suan Ni seemed to want to prove it to you, so he picked you up。",
  "fall_Wed": "There is so much to do this season. $1",
  "fall_Wed4": "How was your day? $1#$e#You seem to smell good.",
  "fall_Fri": "%Suanni seemed to be lost in thought as he stared at the falling leaves in the distance。",
  "fall_Fri8": "In my hometown, it should be very beautiful at this time. $2#$b#The mountains are covered with red leaves and golden wheat fields. $1#$b#I really want to take you to see it...$1",
  "fall_Sat": "Autumn is always relaxing。",
  "fall_Sat4": "Why do people here carve pumpkins? $1#$b# Is there any meaning behind it? $1",
  "fall_Sun": "% Suanni is holding a fallen leaf in his hand, looking a little lonely。",
  "fall_15": "Tomorrow people will exhibit the fruits of their labor. It is a meaningful celebration. $1",
  "fall_26": "My wizard friend seems to be busy all day today. Is there any activity tomorrow? $1",
  "winter_Tue": "Snowing....",
  "winter_Tue4": "In winter, people have more opportunities to socialize, and emotional gathering is always a pleasure. $1",
  "winter_Wed": "Is it snowing in Luxiang? $2",
  "winter_Wed4": "@, I saw a snowman that looks like me, do you know who made it? $1",
  "winter_Thu": "Um.....Keep warm",
  "winter_Thu4": "I'm thinking, should I give Emily some of my own hair. #$b# Or maybe not...$1",
  "winter_Fri": "Do your job well。",
  "winter_Fri4": "The snow scene in Stardew Valley is really beautiful. $1#$b#What do you think, @. $1",
  "winter_Fri8": "%Suanni hugged you, and the warm body temperature and fur made you reluctant to let go。",
  "winter_Sat": "Fishing is not easy this season。",
  "winter_Sun": "You'll get frostbite.",
  "winter_Sun4": "Even though I'm not wearing anything, I'm not cold at all. $1",
  "winter_7": "Have you prepared your fishing rod? You will definitely be able to show off your skills at tomorrow's festival. $1",
  "winter_24": "People's hearts will be closely connected tomorrow...$1#$b#That's great....$2#$b#It's okay, I just miss home a little. $1",
  "dx": "Sorry to have made you worried...$2",
  "dx1": "Sorry for your concern, I'm fine these days...$1",
  "stardrop_gift": "This fruit contains a wonderful spirit. $4#$b#I think it should be helpful to you. $1"


}