{
        "Rainy_Day_0": "I like rainy days. #$b#The sound of raindrops calms me down. #$b#Of course, looking at you has the same effect. $1",
        "Rainy_Day_1": "The water is bright and beautiful when the weather is fine, and the mountains are misty and beautiful when it rains. $1",
        "Rainy_Day_2": "I wonder if they are doing well in the East...$2",
        "Rainy_Day_3": "Do you need me to help you cast a spell to avoid the rain?",
        "Rainy_Day_4": "When you are away, I miss you all the time. $4#$b#It is raining today, why don't you just stay at home. $1",
        "patio_SuanNi": "I built this altar to deepen my connection to the mist. $1#$e#If you want, try it. $1#$b#I will be there to guide you. $1",
        "spouseRoom_SuanNi": "There is no such furniture in Stardew Valley. $1#$b#I made all of this myself. $1#$e#My craftsmanship is not good enough, I will work harder to improve it。",
        "Rainy_Night_0": "Falling asleep to the sound of rain is also a good choice. $1#$b#Don't worry about the cold, I will hold you tight. $1",
        "Rainy_Night_1": "%The Suanni didn't say anything, but the tail wrapped around your waist told his thoughts. #$b# If you want, you can sleep on me.。",
        "Rainy_Night_2": "Come to me, I will hold you tight. $1#$b#",
        "Rainy_Night_3": "If I have a chance, I would like to introduce you to my brothers. $4",
        "Rainy_Night_4": "The night rain continues, moistening everything silently。",
        "Indoor_Day_0": "@, you should pay more attention to rest and be responsible for your own body. #$b# is also responsible for me. $1",
        "Indoor_Day_1": "Are you hungry? I have prepared some food for you. [201 208 210]$1#$e#If you want, I can cook for you often. $1",
        "Indoor_Day_2": "I cherish the present moment, so let's enjoy it. $1。",
        "Indoor_Day_3": "I seem to have adapted to the life with you. $1#$b# So happy and sweet. $1#$e# So addictive. $4",
        "Indoor_Day_4": "%Suanni reached out and hugged you. It felt so good to be buried in his furry mane. #$e# I could hold you like this all day long. $4",
        "Indoor_Night_0": "It's getting late, why don't you come to bed with me? $5#$e#I'll be gentler tonight....$1",
        "Indoor_Night_1": "It seems like I haven't had such a relaxing time for a long time. $1#$b#Come sit next to me. $1",
        "Indoor_Night_2": "%Suanni used his tail to pull you towards him. #$b#% The other person exuded a very comfortable woody scent, making you want to fall asleep in his arms.。",
        "Indoor_Night_3": "Would you like a cup of tea? $1[614]#$b# I made it myself。",
        "Indoor_Night_4": "What do you want me to do tonight? Just tell me. $1",
        "Bad_0": ".....Everything seems to have changed. $2",
        "Bad_1": "*That’s okay, I have my own ideas.",
        "Bad_2": "Your scent seems to be off. $2",
        "Bad_3": "%Suanni looks at you, his eyes seem to reveal indifference. $2",
        "Bad_4": "Um...",
        "Bad_5": "Today.....Forget it...$2#$b#I don't think you want to hear it,$2",
        "Bad_6": "I'm sorry, I can't feel the same emotion you had for me.。",
        "Bad_7": "I can feel your emotions and understand your thoughts. Don't worry, I will understand. $2",
        "Bad_8": "Your eyes...seem not looking at me. $2",
        "Bad_9": "Have you been busy lately? I haven't talked to you for a long time. $2",
        "Outdoor_0": "The weather is very pleasant today. Do you want to go out for a walk? $1#$b#Just the two of us. $1",
        "Outdoor_1": "Suddenly I remembered the days when I was alone in the secret forest. $2#$b#But now you are by my side. $1#$e#I still want to hear you call me dear. $4",
        "Outdoor_2": "The afternoon sun always makes people sleepy...#$b# Not to mention I'm a cat。",
        "Outdoor_3": "%The broad palm of the Suanni holds your hand, and the texture of the meatball is very wonderful. #$b# Is there anything to do today? I will join you? $1",
        "Outdoor_4": "The crops in the fields seem to be very happy. $1#$b#I can feel that they are well taken care of. $1",
        "OneKid_0": "I actually always wanted a child...$2#$b# but will he be bullied by other children...$2#$b# because his father is such a unique... lion. $1",
        "OneKid_1": "%kid1 sometimes pulls my mane. $1#$b#It's a happy trouble.。",
        "OneKid_3": "Actually, dragon blood can make people pregnant...#$b# It's better not to tell @ about this......#$e#@! When did you get here? $1",
        "TwoKids_2": "Now %kid2 will pull my mane together with %kid1。",
        "TwoKids_3": "Such a simple and comfortable family is a dream that is out of reach for many people...$2#$e#I will take good care of our children. $1",
        "Good_0": "% Suanni hugged you from behind, his strong body pressed tightly against yours, looking extremely ambiguous",
        "Good_1": "My favorite. $1",
        "Good_6": "The time I spend with you is never too long. $1",
        "funLeave_SuanNi": "I will be back in the evening. #$b# will miss you all day. $4",
        "funReturn_SuanNi": "Next time, let's go out together, okay? $4",
        "spring_1": "The spring breeze has greened the south bank of the river again. When will the bright moon shine on me again?。",
        "spring_6": "The breath of spring...$1#$b# is so comfortable...$1#$e#would you like to go out and pick some flowers?$1",
        "spring_8": "% Suanni handed you a flower with the scent of spring。[18]",
        "spring_12": "Easter is tomorrow, I should prepare well. $1",
        "spring_23": "The new year's Beauty and the Beast will also be performed tomorrow. $1",
        "summer_1": "The lotus leaves are endless and green, and the lotus flowers are red in the sun. $1",
        "summer_5": "I like summer very much. $1#$e#Because I can wear no clothes openly? $1#$e#Why do I think so. $1",
        "summer_10": "Have you prepared the ingredients for tomorrow's soup? Let me know what I'm going to do. $1",
        "summer_15": "@, I seem to get hotter when I see you. $4",
        "summer_27": "I will wait for you at the beach tomorrow night. #$b#% Suanni leaned over and kissed you with a gentle breath.",
        "fall_1": "The setting sun and the solitary wild goose fly together, and the autumn water and the sky are the same color. $1",
        "fall_15": "What have you prepared this year? $1#$b# Let me guess. #$b# Extra large crops? $1",
        "fall_26": "Don't worry, you have me. $4#$b# Feel free to attend tomorrow's festival. $1",
        "winter_1": "Boat PC World Weng, fishing alone trees and snow。",
        "winter_7": "Tomorrow is the ice fishing festival. $1#$b#I really can't eat so many fish. $1",
        "winter_28": "According to your festival, I should say Happy New Year to you. $1#$b#% Suanni picked you up and gave you a big kiss, his beard rubbing against your cheek, making it a little itchy.",
        "NoBed_0": "Is it my illusion, or is our bed really gone?.",
        "NoBed_1": "Are you ready to sleep in my arms at night? I'd be happy to. $1",
        "NoBed_2": "Hmm... I'm thinking about the possibility of using fog to replace the bed. #$b# Don't think too much, I'm really thinking about it. $1",
        "NoBed_3": "Don't worry, as long as you sleep in my arms, you won't catch a cold. $1"

}